<a href="https://colab.research.google.com/github/maro000/for_data_analysis_and_visualization/blob/master/index_merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
from pandas import DataFrame as df

In [0]:
df_left = df({'key': ['X','Y','Z','X','Y'],
                  'data': range(5)})

In [5]:
df_left

  key  data
0   X     0
1   Y     1
2   Z     2
3   X     3
4   Y     4

In [0]:
df_right = df({'group_data': [10, 20]}, index=['X', 'Y'])

In [7]:
df_right

   group_data
X          10
Y          20

In [11]:
pd.merge(df_left,df_right, left_on ='key',right_index=True)

  key  data  group_data
0   X     0          10
3   X     3          10
1   Y     1          20
4   Y     4          20

In [12]:
pd.merge(df_left,df_right, left_on ='key',right_index=True, how ='outer')

  key  data  group_data
0   X     0        10.0
3   X     3        10.0
1   Y     1        20.0
4   Y     4        20.0
2   Z     2         NaN

In [0]:
df_left_hr = df({'key1': ['SF','SF','SF','LA','LA'],
                   'key2': [10, 20, 30, 20, 30],
                   'data_set': np.arange(5.)})
df_right_hr = df(np.arange(10).reshape((5, 2)),
                   index=[['LA','LA','SF','SF','SF'],
                          [20, 10, 10, 10, 20]],
                   columns=['col_1', 'col_2'])

In [15]:
df_left_hr

  key1  key2  data_set
0   SF    10       0.0
1   SF    20       1.0
2   SF    30       2.0
3   LA    20       3.0
4   LA    30       4.0